In [1]:
#Importing Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df=pd.read_csv("Tree.csv") #Reading the csv file

In [13]:
df.head() #Calling Head data

  company                job education  sal_more_than_50K
0     TCS  PROJECT EXECUTIVE    B.TECH                  0
1     TCS  PROJECT EXECUTIVE    M.TECH                  0
2     TCS    PROJECT MANAGER    B.TECH                  1
3     TCS    PROJECT MANAGER    M.TECH                  1
4     TCS         PROGRAMMER    B.TECH                  0

In [9]:
#Seperating Character data by using data types function
df_car=df.select_dtypes(include=[object])

In [10]:
#Check chracter data 
df_car

      company                job education
0         TCS  PROJECT EXECUTIVE    B.TECH
1         TCS  PROJECT EXECUTIVE    M.TECH
2         TCS    PROJECT MANAGER    B.TECH
3         TCS    PROJECT MANAGER    M.TECH
4         TCS         PROGRAMMER    B.TECH
5         TCS         PROGRAMMER    M.TECH
6     INFOSYS  PROJECT EXECUTIVE    M.TECH
7     INFOSYS         PROGRAMMER    B.TECH
8     INFOSYS    PROJECT MANAGER    B.TECH
9     INFOSYS    PROJECT MANAGER    M.TECH
10  MICROSOFT  PROJECT EXECUTIVE    B.TECH
11  MICROSOFT  PROJECT EXECUTIVE    M.TECH
12  MICROSOFT    PROJECT MANAGER    B.TECH
13  MICROSOFT    PROJECT MANAGER    M.TECH
14  MICROSOFT         PROGRAMMER    B.TECH
15  MICROSOFT         PROGRAMMER    M.TECH

In [11]:
#Seperating Number data by selecting data types as np.number
df_num=df.select_dtypes(include=[np.number])

In [12]:
#Calling number data 
df_num

    sal_more_than_50K
0                   0
1                   0
2                   1
3                   1
4                   0
5                   1
6                   0
7                   0
8                   0
9                   1
10                  1
11                  1
12                  1
13                  1
14                  1
15                  1

In [14]:
#Check how many nulls are there in character data.
df_car.isnull().sum()

company      0
job          0
education    0
dtype: int64

In [17]:
#Checking how much job column percentage is effecting on total character data set

(df_car.job.isnull().sum())/len(df_car)

0.0

In [18]:
#Checking how much company column percentage is effecting on total character data set

(df_car.company.isnull().sum())/len(df_car)

0.0

In [21]:
#Checking how much eduction column percentage is effecting on total character data set

(df_car.education.isnull().sum())/len(df_car)

0.0

In [22]:
#checking how many nulls availbale in the df_num

df_num.isnull().sum()

sal_more_than_50K    0
dtype: int64

In [23]:
#checking how much percentage of below column is effecting the Number data set

(df_num.sal_more_than_50K.isnull().sum())/len(df_num)

0.0

In [26]:
#importing Label Encoder to Conver the data text data into numeric
from sklearn.preprocessing import LabelEncoder

In [28]:
#Calling label Encoder into Le
le = LabelEncoder()

In [33]:
#Apply the fit transform label encoder function to character data 
df_car = df_car.apply(le.fit_transform)

In [34]:
#Checking how character data converted to numer data 
df_car

    company  job  education
0         2    1          0
1         2    1          1
2         2    2          0
3         2    2          1
4         2    0          0
5         2    0          1
6         0    1          1
7         0    0          0
8         0    2          0
9         0    2          1
10        1    1          0
11        1    1          1
12        1    2          0
13        1    2          1
14        1    0          0
15        1    0          1

In [43]:
#Conactinating the Charater data set and numeric data set by using concat function

df_final = pd.concat([df_num,df_car], axis = 1)

In [44]:
#Check the the data is concatinating into data_final or not calling df_final
df_final

    sal_more_than_50K  company  job  education
0                   0        2    1          0
1                   0        2    1          1
2                   1        2    2          0
3                   1        2    2          1
4                   0        2    0          0
5                   1        2    0          1
6                   0        0    1          1
7                   0        0    0          0
8                   0        0    2          0
9                   1        0    2          1
10                  1        1    1          0
11                  1        1    1          1
12                  1        1    2          0
13                  1        1    2          1
14                  1        1    0          0
15                  1        1    0          1

In [46]:
x=df_car

In [47]:
x

    company  job  education
0         2    1          0
1         2    1          1
2         2    2          0
3         2    2          1
4         2    0          0
5         2    0          1
6         0    1          1
7         0    0          0
8         0    2          0
9         0    2          1
10        1    1          0
11        1    1          1
12        1    2          0
13        1    2          1
14        1    0          0
15        1    0          1

In [48]:
y=df_num

In [49]:
y

    sal_more_than_50K
0                   0
1                   0
2                   1
3                   1
4                   0
5                   1
6                   0
7                   0
8                   0
9                   1
10                  1
11                  1
12                  1
13                  1
14                  1
15                  1

In [53]:
from sklearn.model_selection import train_test_split

In [54]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=42)

In [55]:
from sklearn.ensemble import RandomForestClassifier

In [56]:
RFC = RandomForestClassifier()

In [57]:
RFC.fit(x_train,y_train)

<ipython-input-57-32afe0bc9932>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  RFC.fit(x_train,y_train)

RandomForestClassifier()

In [59]:
RFC.score(x_train,y_train)

1.0

In [60]:
pre = RFC.predict(x_test)

In [62]:
val = RFC.predict([[1,1,0]])
val

array([1], dtype=int64)

In [64]:
val1 = RFC.predict([[0,2,0]])
val1

array([0], dtype=int64)